{"nodes":[{"node":{"title":"1777","description":"On April 20, 1777, the New York State Constitution is adopted by the Convention of Representatives of the State of New York and read from the Kingston Courthouse in Kingston, New York. Under this State Constitution, three governmental branches are created: the executive branch, the judicial branch and the legislative branch which is made up of two-houses, including the Senate, with 24 senators elected every four years from four Senate districts, and the Assembly, with 70 assemblymen elected annually from 14 districts. New York State Legislature meets in Kingston for first time in September.\n","start":"Sun, 04/20/1777","end":""}},{"node":{"title":"1790","description":"First reapportionment acts passed when federal census indicates New York's districts in the west require more legislative representation. As a result, new senatorial districts are added.\n","start":"Fri, 01/01/1790","end":""}},{"node":{"title":"1797","description":"Although New York City, Kingston, Poughkeepsie, and Fishkill had hosted legislative sessions, the Stadt Huys building in Albany, is picked to house the New York State Legislature. Located in Albany where Hudson and Market Street cross, the Stadt Huys building also serves as the City Hall, County Court House, prison, and State House.\n","start":"Sun, 01/01/1797","end":""}},{"node":{"title":"1801","description":"First New York Constitutional Convention is held. As a result of this convention, the number of senators is increased to 32, number of assemblymen is set to 100, and provisions are instituted to review and address legislative representation following each census.\n","start":"Thu, 01/01/1801","end":""}},{"node":{"title":"1809","description":"Legislature moves into new building on State Street in Albany.\n","start":"Sun, 01/01/1809","end":""}},{"node":{"title":"1817","description":"New York Legislature outlaws slavery by 1827.\n","start":"Wed, 01/01/1817","end":""}},{"node":{"title":"August 28, 1821","description":"New York State's second Constitutional Convention is held in Albany. As a result of this convention, Senate consent is only required on important appointments. Voting rights are also addressed and extended to male citizens over 21 who hold property, performed military service, or worked on highways.\n","start":"Tue, 08/28/1821","end":""}},{"node":{"title":"June, 1846","description":"New York State's Constitutional Convention of 1846 is held. As a result, legislature's power is diminished with restrictions, senators and assemblymen are elected from a single district and the term of a senator is altered from four years to two.\n","start":"Mon, 06/01/1846","end":""}},{"node":{"title":"1867","description":"New York State's Constitutional Convention of 1867 is held. Black suffrage is recommended but is defeated by convention.\n","start":"Tue, 01/01/1867","end":""}},{"node":{"title":"1868","description":"A quarter of a million dollars is appropriated by the New York State Legislature for the construction of a new Capitol. The Capitol Commission is warned not to exceed four million dollars on project.\n","start":"Wed, 01/01/1868","end":""}},{"node":{"title":"January 7, 1879","description":"Escorted by Senate members, the Assembly moves into the Assembly Chamber in the new Capitol of which only one quarter is completed. The Senate uses the Court of Appeals room in the Capitol since its chamber is not finished.\n","start":"Tue, 01/07/1879","end":""}},{"node":{"title":"March 10, 1881","description":"Escorted by Assembly members, the Senate moves into the Senate Chamber in the new Capitol. In the coming eight years, other rooms in the Capitol are occupied.\n","start":"Thu, 03/10/1881","end":""}},{"node":{"title":"May 8, 1894","description":"New York State's Constitutional Convention of 1894 is held. As a result of this convention, the number of senators is increased from 32 to 50 with no more than one-third of the senators coming from New York City and no more than one-half coming from New York City and Brooklyn. In addition, the number of assemblymen is increased from 128 to 150, each county must have a minimum of one assemblyman with the exception of Hamilton and Fulton which are to share one assembly seat, riders cannot be attached to appropriation bills, state elections are to be held on even years and municipal elections are to be held on odd years, the Governor's term is changed from three to two years, and legislative bills are to be printed at least three days before their passage.\n","start":"Tue, 05/08/1894","end":""}},{"node":{"title":"January 1, 1899","description":"Governor Theodore Roosevelt is the first governor to take oath in Capitol building which he declares is \"completed.\" The Capitol structure took 32 years to build and cost 25 million dollars.\n","start":"Sun, 01/01/1899","end":""}},{"node":{"title":"1915","description":"New York State Legislature gives women the right to vote, but voters reject bill.\n","start":"Fri, 01/01/1915","end":""}},{"node":{"title":"1917","description":"Voters approve bill giving women the right to vote. This is three years before ratification of the 19th amendment to the U.S. Constitution which extended this right nationwide.\n","start":"Mon, 01/01/1917","end":""}},{"node":{"title":"1938","description":"New York State's Constitutional Convention of 1938 is held and for the first time women take part.\n","start":"Sat, 01/01/1938","end":""}},{"node":{"title":"January, 1962","description":"New York State Legislature appropriates money for \"South Mall Project\" which eventually becomes known as the \"Empire State Plaza.\" Construction on plaza begins in July with Wallace K. Harrison as the principal architect.\n","start":"Mon, 01/01/1962","end":""}},{"node":{"title":"1964","description":"New York State Senate and Assembly are ordered to reapportion districts by United States Supreme Court \"since legislative districts needed to be approximately equal in terms of population.\" With this declaration: 1964 members are to serve one year based on old districts; in 1965 a special election is to be held and newly elected members are to serve one year; and in 1966 a regular election is to be held based on the new districts and new members are to serve regular terms. When the Senate and Assembly fail to reach a compromise on reapportionment in February of 1966, a commission is set up by the Court of Appeals to create a reapportionment plan.\n","start":"Wed, 01/01/1964","end":""}},{"node":{"title":"January, 1972","description":"The Legislative Office Building (LOB), which is part of the Empire State Plaza, is completed and houses the offices of legislators.\n","start":"Sat, 01/01/1972","end":""}},{"node":{"title":"September 11 - 17, 2001","description":"World Trade Center is attacked in New York City. In the months to come, the United States deploys troops to Afghanistan to fight terrorism. Both Houses of the State Legislature meet in an historic joint session and adopt resolution condemning the recent terrorist attack. New York State Legislature passes legislation to combat terrorism. (Chapter 300, Laws of 2001)\n","start":"Tue, 09/11/2001","end":""}}]}